growfs.org
#+TITLE: Disk Resize Under FreeBSD

* List Disks

  First to list the geoms:  
  #+BEGIN_EXAMPLE
    gpart list
    =>
    Geom name: vtbd0
    modified: false
    state: CORRUPT
    ...
  #+END_EXAMPLE

* Show and Recover if Needed

  Show the Geom: 
  #+BEGIN_EXAMPLE
    gpart show vtbd0
    =>       3  44040315  vtbd0  GPT  (40G) [CORRUPT]
             3       118      1  freebsd-boot  (59K)
           121   2097152      2  freebsd-swap  (1.0G)
       2097273  41943040      3  freebsd-ufs  (20G)
      44040313         5         - free -  (2.5K)
  #+END_EXAMPLE
  
  If the =state= shows =CORRUPT=, we need to recover it:  
  #+BEGIN_EXAMPLE
    gpart recover vtbd0
    vtbd0 recovered
  #+END_EXAMPLE

  Show again and the =CORRUPT= mark disappeared:  
  #+BEGIN_EXAMPLE
    gpart show vtbd0
    =>       3  83886069  vtbd0  GPT  (40G)
           3       118      1  freebsd-boot  (59K)
         121   2097152      2  freebsd-swap  (1.0G)
     2097273  41943040      3  freebsd-ufs  (20G)
    44040313  39845759         - free -  (19G)
  #+END_EXAMPLE

  Apparently the partition 3 should be resized.

* Resize Partition
  Run resize on partition 3:
  #+BEGIN_EXAMPLE
    gpart resize -i 3 -a 4k vtbd0
    vtbd0p3 resized
    gpart show vtbd0
    =>       3  83886069  vtbd0  GPT  (40G)
             3       118      1  freebsd-boot  (59K)
           121   2097152      2  freebsd-swap  (1.0G)
       2097273  81788799      3  freebsd-ufs  (39G)
  #+END_EXAMPLE

* Grow Filesystem

  According [[https://www.freebsd.org/doc/handbook/disks-growing.html][FreeBSD Doc]], =growfs= should be run as below:
  #+BEGIN_EXAMPLE
    growfs /dev/vtbd0p3
  #+END_EXAMPLE  

  But it doesn't work with below error reported:
  #+BEGIN_EXAMPLE
    growfs: /dev/vtbd0p3: Operation not permitted  
  #+END_EXAMPLE

  A workaround is to run =service growfs onestart=:
  #+BEGIN_EXAMPLE
    service growfs onestart
    Growing root partition to fill device
    vtbd0 recovering is not needed
    vtbd0p3 resized
    super-block backups (for fsck_ffs -b #) at:
     42314112, 43596352, 44878592, 46160832, 47443072, 48725312, 50007552, 51289792, 52572032, 53854272, 55136512,
     56418752, 57700992, 58983232, 60265472, 61547712, 62829952, 64112192, 65394432, 66676672, 67958912, 69241152,
     70523392, 71805632, 73087872, 74370112, 75652352, 76934592, 78216832, 79499072, 80781312
  #+END_EXAMPLE

  After that I run =shutdown -r now=, the VM hang at:
  #+BEGIN_EXAMPLE
  run_interrupt_driven_hooks: still waiting after 60 seconds for xpt_config
  run_interrupt_driven_hooks: still waiting after 120 seconds for xpt_config
  #+END_EXAMPLE

  After force restarted it's bootable again.

  Looks FreeBSD image is not polished well for cloud using.
